In [1]:
import pandas as pd

In [2]:
ser = pd.Series([100, 'foo', 300, 'bar', 500], ['tom', 'bob', 'nancy', 'dan', 'eric'])
ser

tom      100
bob      foo
nancy    300
dan      bar
eric     500
dtype: object

In [3]:
ser.index

Index(['tom', 'bob', 'nancy', 'dan', 'eric'], dtype='object')

In [4]:
serOne = pd.Series(data = [100, 'foo', 300, 'bar', 500, 'what'], index = ['apple', 'ball', 'cat', 'dog', 'elephant', 'cat'])
serOne

apple        100
ball         foo
cat          300
dog          bar
elephant     500
cat         what
dtype: object

In [5]:
serOne['cat']

cat     300
cat    what
dtype: object

In [6]:
serOne.loc['cat']

cat     300
cat    what
dtype: object

In [7]:
serOne.iloc[1]

'foo'

In [8]:
serOne[['apple', 'cat']]

apple     100
cat       300
cat      what
dtype: object

In [9]:
serOne[[1, 2, 3]]

ball    foo
cat     300
dog     bar
dtype: object

In [10]:
'cat' in serOne.index

True

In [11]:
'foo' in serOne.values

True

In [12]:
serOne

apple        100
ball         foo
cat          300
dog          bar
elephant     500
cat         what
dtype: object

In [13]:
serOne* 2

apple            200
ball          foofoo
cat              600
dog           barbar
elephant        1000
cat         whatwhat
dtype: object

In [14]:
serOne[['apple','elephant']] ** 2

apple        10000
elephant    250000
dtype: object

In [15]:
panDict = {'one' : pd.Series(data = [1, 2, 3, 4], index = ['Apple', 'Ball', 'Cat', 'Dog']),
          'two' : pd.Series(data = [1, 2, 3, 5], index = ['Apple', 'Ball', 'Cat', 'Elephant'])}

In [16]:
df = pd.DataFrame(panDict)
df

          one  two
Apple     1.0  1.0
Ball      2.0  2.0
Cat       3.0  3.0
Dog       4.0  NaN
Elephant  NaN  5.0

In [17]:
df.columns

Index(['one', 'two'], dtype='object')

In [18]:
df.index

Index(['Apple', 'Ball', 'Cat', 'Dog', 'Elephant'], dtype='object')

In [19]:
pd.DataFrame(panDict, index = ['Apple', 'Ball', 'Cat'])

       one  two
Apple    1    1
Ball     2    2
Cat      3    3

In [20]:
data = [{1 : 'Apple', 2 : 'Ball'}, {3 : 'Cat', 4 : 'Dog'}]

In [21]:
pd.DataFrame(data, index=['One', 'Two'])

         1     2    3    4
One  Apple  Ball  NaN  NaN
Two    NaN   NaN  Cat  Dog

In [22]:
pd.DataFrame(data)

       1     2    3    4
0  Apple  Ball  NaN  NaN
1    NaN   NaN  Cat  Dog

In [23]:
pd.DataFrame(data, columns = [1, 4])

       1    4
0  Apple  NaN
1    NaN  Dog

In [24]:
df

          one  two
Apple     1.0  1.0
Ball      2.0  2.0
Cat       3.0  3.0
Dog       4.0  NaN
Elephant  NaN  5.0

In [25]:
df['one']

Apple       1.0
Ball        2.0
Cat         3.0
Dog         4.0
Elephant    NaN
Name: one, dtype: float64

In [26]:
df.loc['Apple']

one    1.0
two    1.0
Name: Apple, dtype: float64

In [27]:
df['three'] = df['one'] * df['two']
df

          one  two  three
Apple     1.0  1.0    1.0
Ball      2.0  2.0    4.0
Cat       3.0  3.0    9.0
Dog       4.0  NaN    NaN
Elephant  NaN  5.0    NaN

In [28]:
df['one']['Apple']

1.0

In [30]:
df['one']['Frog'] = df['one']['Apple'] + df['one']['Ball']
df['one']['Frog']

3.0

In [31]:
df.shape

(5, 3)

In [32]:
df['Flag'] = df['one'] > 2
df

          one  two  three   Flag
Apple     1.0  1.0    1.0  False
Ball      2.0  2.0    4.0  False
Cat       3.0  3.0    9.0   True
Dog       4.0  NaN    NaN   True
Elephant  NaN  5.0    NaN  False

In [33]:
three = df.pop('three')
three

Apple       1.0
Ball        4.0
Cat         9.0
Dog         NaN
Elephant    NaN
Name: three, dtype: float64

In [34]:
df

          one  two   Flag
Apple     1.0  1.0  False
Ball      2.0  2.0  False
Cat       3.0  3.0   True
Dog       4.0  NaN   True
Elephant  NaN  5.0  False

In [35]:
df['Temp'] = df['Flag'] == True
df

          one  two   Flag   Temp
Apple     1.0  1.0  False  False
Ball      2.0  2.0  False  False
Cat       3.0  3.0   True   True
Dog       4.0  NaN   True   True
Elephant  NaN  5.0  False  False

In [36]:
Flag = df.pop('Flag')

In [37]:
df

          one  two   Temp
Apple     1.0  1.0  False
Ball      2.0  2.0  False
Cat       3.0  3.0   True
Dog       4.0  NaN   True
Elephant  NaN  5.0  False

In [38]:
df.pop('Temp')

Apple       False
Ball        False
Cat          True
Dog          True
Elephant    False
Name: Temp, dtype: bool

In [39]:
df['three'] = three
df['Flag'] = Flag

In [40]:
df

          one  two  three   Flag
Apple     1.0  1.0    1.0  False
Ball      2.0  2.0    4.0  False
Cat       3.0  3.0    9.0   True
Dog       4.0  NaN    NaN   True
Elephant  NaN  5.0    NaN  False

In [41]:
del df['three']
df

          one  two   Flag
Apple     1.0  1.0  False
Ball      2.0  2.0  False
Cat       3.0  3.0   True
Dog       4.0  NaN   True
Elephant  NaN  5.0  False

In [42]:
df['two']['Dog'] = 10.0
df

C:\Users\Xenon\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

          one   two   Flag
Apple     1.0   1.0  False
Ball      2.0   2.0  False
Cat       3.0   3.0   True
Dog       4.0  10.0   True
Elephant  NaN   5.0  False

In [43]:
df.insert(0, 'copy_of_one', df['one'])
df

          copy_of_one  one   two   Flag
Apple             1.0  1.0   1.0  False
Ball              2.0  2.0   2.0  False
Cat               3.0  3.0   3.0   True
Dog               4.0  4.0  10.0   True
Elephant          NaN  NaN   5.0  False

In [45]:
#df.pop('half_copy_two')

In [46]:
df['half_copy_two'] = df['two'][1:3:3]
df

          copy_of_one  one   two   Flag  half_copy_two
Apple             1.0  1.0   1.0  False            NaN
Ball              2.0  2.0   2.0  False            2.0
Cat               3.0  3.0   3.0   True            NaN
Dog               4.0  4.0  10.0   True            NaN
Elephant          NaN  NaN   5.0  False            NaN

In [47]:
dfTemp = {'Frog' : pd.Series(data = [1, 2, 3, True, 5], index = ['copy_of_one', 'one', 'two', 'Flag', 'half_copy_two'])}
pd.DataFrame(dfTemp)

               Frog
copy_of_one       1
one               2
two               3
Flag           True
half_copy_two     5

In [48]:
del dfTemp

In [49]:
dfTemp = {'copy_of_one' : pd.Series(data = [1], index = ['Frog']), 'one' : pd.Series(data = [1], index = ['Frog']), 'two' : pd.Series(data = [1], index = ['Frog']), 'Flag' : pd.Series(data = [1], index = ['Frog']), 'half_copy_two' : pd.Series(data = [1], index = ['Frog'])}
dfT = pd.DataFrame(dfTemp)

In [50]:
df

          copy_of_one  one   two   Flag  half_copy_two
Apple             1.0  1.0   1.0  False            NaN
Ball              2.0  2.0   2.0  False            2.0
Cat               3.0  3.0   3.0   True            NaN
Dog               4.0  4.0  10.0   True            NaN
Elephant          NaN  NaN   5.0  False            NaN

In [51]:
df['other'] = [1, 2, 3, 4, 5]
df

          copy_of_one  one   two   Flag  half_copy_two  other
Apple             1.0  1.0   1.0  False            NaN      1
Ball              2.0  2.0   2.0  False            2.0      2
Cat               3.0  3.0   3.0   True            NaN      3
Dog               4.0  4.0  10.0   True            NaN      4
Elephant          NaN  NaN   5.0  False            NaN      5

In [52]:
del df['other']
df

          copy_of_one  one   two   Flag  half_copy_two
Apple             1.0  1.0   1.0  False            NaN
Ball              2.0  2.0   2.0  False            2.0
Cat               3.0  3.0   3.0   True            NaN
Dog               4.0  4.0  10.0   True            NaN
Elephant          NaN  NaN   5.0  False            NaN

In [53]:
dfCopy = df.copy()
dfCopy = pd.DataFrame(dfCopy, dfTemp)
dfCopy

               copy_of_one  one  two Flag  half_copy_two
copy_of_one            NaN  NaN  NaN  NaN            NaN
one                    NaN  NaN  NaN  NaN            NaN
two                    NaN  NaN  NaN  NaN            NaN
Flag                   NaN  NaN  NaN  NaN            NaN
half_copy_two          NaN  NaN  NaN  NaN            NaN

In [54]:
listOne = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [55]:
listOne[2:5 and 7:]

[3, 4, 5, 6, 7]

In [56]:
df.loc['Apple']

copy_of_one          1
one                  1
two                  1
Flag             False
half_copy_two      NaN
Name: Apple, dtype: object

In [57]:
df.iloc[0]

copy_of_one          1
one                  1
two                  1
Flag             False
half_copy_two      NaN
Name: Apple, dtype: object